app/controllers/admin/albums_controller.rb

SELECT * FROM `albums`
---
  def index
    @albums = Album.all

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
	def edit
		@album = Album.find(params[:id])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
UPDATE `albums` SET `updated_at` = '2010-07-15 11:40:44', `visible` = 0, `title` = '123' WHERE `id` = 1
---
	def update
    @album = Album.find(params[:id])
		@title = 'Редактирование альбома'
		respond_to do |format|
			if @album.update_attributes(params[:album])