app/controllers/admin/rooms_controller.rb

SELECT * FROM `rooms`
---
  def index
    @rooms = Room.all

SELECT * FROM `rooms` WHERE (`rooms`.`id` = 2)
---
  def edit
		@room = Room.find(params[:id])

INSERT INTO `rooms` (`uri`, `photo_file_size`, `created_at`, `title`, `photo_file_name`, `updated_at`, `photo_content_type`, `photo_updated_at`, `description`) VALUES('title', NULL, '2010-07-15 12:39:44', '123', NULL, '2010-07-15 12:39:44', NULL, NULL, '<p>\r\n	Ыыыыыыыыы</p>\r\n')
---
  def create
		@room = Room.new(params[:room])
		@title = 'Добавление зала'
		respond_to do |format|
  		if @room.save

SELECT * FROM `rooms` WHERE (`rooms`.`id` = 2)
UPDATE `rooms` SET `updated_at` = '2010-07-15 13:07:32', `photo_file_name` = 'x_e5922076.jpg', `photo_updated_at` = '2010-07-15 13:07:31', `photo_file_size` = 49733, `photo_content_type` = 'image/jpeg' WHERE `id` = 2
---
  def update
    @room = Room.find(params[:id])
		@title = 'Редактирование информации о зале'
		respond_to do |format|
			if @room.update_attributes(params[:room])

SELECT * FROM `rooms` WHERE (`rooms`.`id` = 3)
DELETE FROM `rooms` WHERE `id` = 3
---
  def destroy
    @room = Room.find(params[:id])
    @room.destroy