app/controllers/special_controller.rb

  def index
    @photos = Photo.all
---
SELECT * FROM `photos` WHERE (in_voting)