app/controllers/tour_controller.rb

  def show
    @room = Room.find_by_uri(params[:id])
---
SELECT * FROM `rooms` WHERE (`rooms`.`uri` = 'room') LIMIT 1